"""
测试逻辑运算符的用法
描述：某手机店在每周二的上午10点-11点和每周五的下午3点-5点进行打折促销优惠活动，使用Python到吗实现此描述
"""
# 解决：使用逻辑判断 + if -- else语句即可
# 注意：对输入的错误信息进行友好的提示
# 将一周的天数表示成枚举类型
weekday = {"星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日"}
hour = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23}

today = input("请输入中文星期(如：星期一):")
time = int(input("请输入时间中的小时(0-23):"))  # 莫忘了类型转换
if today not in weekday:
    today = input("您输入的中文星期格式不正确,请重新输入:")
elif time not in hour:
    time = int(input("您输入的小时数不正确，请重新输入:"))
else:
    pass

if (today == "星期二" and (10 <= time <= 11)) or (today == "星期五" and (15 <= time <= 17)):
    print("恭喜您！您真幸运，获得了折扣活动参与资格，快快选购吧！！！")
else:
    print("对不起，您来晚一步！今天的折扣活动已经过期了，期待您的下次光临...")
